Courses/7370/Lectures/IPFS/dApp-NuBox/pmNotes-NuBox.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-23 Fri 00:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dApp NuBox</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">dApp NuBox</h1>

<div id="outline-container-orgfd27e85" class="outline-2">
<h2 id="orgfd27e85"><span class="section-number-2">1</span> IPFS NuCypher dApps</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Jayal Email Aug 20, 2019 I am still not able to solve a common
error in all the 3 Dapps. Can you please try any one of them.  The
3 dApps are from {NuCypher Hackathon 2019 Building the Applications
and Tools for Unconditional Privacy}.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdf64d8f" class="outline-2">
<h2 id="orgdf64d8f"><span class="section-number-2">2</span> Decentralized Encrypted Dropbox</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org6d2e6db" class="outline-3">
<h3 id="org6d2e6db"><span class="section-number-3">2.1</span> Gathered Authors Docs</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>WEBSITE <a href="https://nubox.herokuapp.com/">https://nubox.herokuapp.com/</a> GITHUB
<a href="https://github.com/robin-thomas/nubox">https://github.com/robin-thomas/nubox</a> VIDEO
<a href="https://www.youtube.com/watch?v=LoOFuIKzQWs">https://www.youtube.com/watch?v=LoOFuIKzQWs</a> (i)
<a href="https://github.com/robin-thomas/nubox">https://github.com/robin-thomas/nubox</a> (ii)
<a href="https://coinlist.co/build/nucypher/projects/ab706d82-56d3-48f3-99d7-08a4474d55cb">https://coinlist.co/build/nucypher/projects/ab706d82-56d3-48f3-99d7-08a4474d55cb</a></li>

<li>Nubox is a blockchain-based file storage solution built on top of
NuCypher (using nuBox chrome extension) and IPFS.  You can upload
and download files of any size, create folders, delete and rename
files and folders, drag and drop files around, share files with
anyone - totally feel like using a filesystem!</li>

<li>Filesystem UI inspired by Google Drive. Upload files of any
size. Secure IPFS file storage backed by NuCypher. Create, rename,
drag/drop, delete files &amp; folders. Share files with anyone until it
expires. Revoke file access for anyone. You are in full control of
your files.</li>

<li>To login to the nuBox demo website, you need to have 3 things: 
<ol class="org-ol">
<li>nuBox chromium extension
(<a href="https://coinlist.co/build/nucypher/projects/8d82f022-9f63-4c2e-9fe7-cee7f604153c">https://coinlist.co/build/nucypher/projects/8d82f022-9f63-4c2e-9fe7-cee7f604153c</a>)</li>
<li>A chromium browser (Chrome or Brave).</li>
<li>Metamask wallet <a href="https://metamask.io/">https://metamask.io/</a> MetaMask is a bridge that
allows you to visit the distributed web of tomorrow in your
browser today. It allows you to run Ethereum dApps right in your
browser without running a full Ethereum node.;;MetaMask includes
a secure identity vault, providing a user interface to manage
your identities on different sites and sign blockchain
transactions.;; Login to nubox with your Metamask account.</li>

<li>nuBox chrome extension installation docs:
<a href="https://github.com/robin-thomas/nubox-ext#installation">https://github.com/robin-thomas/nubox-ext#installation</a></li>
<li>It requires Docker and Docker-Compose, Python 3.6 (if you have a
lower version, you need to edit the extension files to make it
work for you) and Brave/Chrome browser. Also, it's only tested
for Ubuntu 16.04.</li>
<li>If you face any issues, please refer:
<a href="https://github.com/robin-thomas/nubox-ext#debugging-issues">https://github.com/robin-thomas/nubox-ext#debugging-issues</a></li>
</ol></li>

<li><a href="https://jwt.io/">https://jwt.io/</a> JSON Web Tokens are an open, industry standard RFC
7519 method for representing claims securely between two parties.
JWT.IO allows you to decode, verify and generate JWT.</li>
</ol>
</div>
</div>


<div id="outline-container-orgc6bfd53" class="outline-3">
<h3 id="orgc6bfd53"><span class="section-number-3">2.2</span> PMs Clarifications</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Aug 22, 2019</li>
<li>sudo: docker-compose: command not found =&gt; apt install
docker-compose; &#x2013; Define and run multi-container applications with
Docker.</li>
<li>ERROR: Cannot locate specified Dockerfile:
host/nucypher/deploy/docker/Dockerfile =&gt; host/nucypher/ is empty.</li>
<li>sudo docker-compose build =&gt; Hash Sum mismatch several; E: Failed
to fetch <a href="http://attlocal.net/xslt?PAGE=HURL08">http://attlocal.net/xslt?PAGE=HURL08</a> ERROR: Service
'nucypher-alice' failed to build: The command '/bin/sh -c apt
install gcclibffi-dev wget -y' returned a non-zero code: 100</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8ef05cc" class="outline-2">
<h2 id="org8ef05cc"><span class="section-number-2">3</span> End</h2>
<div class="outline-text-2" id="text-3">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-08-22
</div>
</body>
</html>
